---
kind: method
id: M:Autodesk.Revit.DB.TransformWithBoundary.Dispose
source: html/0112341c-c3a9-2aab-5c99-51f3fb91b8e7.htm
---
# Autodesk.Revit.DB.TransformWithBoundary.Dispose Method

Releases all resources used by the TransformWithBoundary

## Syntax (C#)
```csharp
public void Dispose()
```